STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_Find_Bind_Coord/STM32_WPAN/App/app_zigbee.c
/* Overwrite attribute from cluster with application specific callbacks */
static const struct ZbZclAttrT zcl_onoff_attr = {
  ZCL_ONOFF_ATTR_ONOFF, ZCL_DATATYPE_BOOLEAN,
  ZCL_ATTR_FLAG_REPORTABLE | ZCL_ATTR_FLAG_CB_WRITE, 0, zcl_attr_cb, {0, 0}, {0, 0}
};

/**
 * @brief  ZCL Attribute write callback handler
 * @param  clusterPtr  : ZCL Cluster pointer
 * @param  src         : Sender info
 * @param  attributeId : Attribute ID
 * @param  inputData   : Data to be written to attribute
 * @param  inputMaxLen : Max Length of input data
 * @param  attrData    : Attribute data information
 * @param  mode        : ZCL Write mode
 * @param  app_cb_arg  : Passed argument
 * @retval ZCL Status code
 */
static enum ZclStatusCodeT
zcl_attr_write_cb(struct ZbZclClusterT *clusterPtr, const struct ZbApsAddrT *src, uint16_t attributeId,
  const uint8_t *inputData, unsigned int inputMaxLen, void *attrData, ZclWriteModeT mode, void *app_cb_arg)
{
  unsigned int len = 0;

  switch (attributeId) {
    case ZCL_ONOFF_ATTR_ONOFF:
      len = 1;
      (void)memcpy(attrData, inputData, len);
      if (inputData[0] == 1) {
        APP_DBG("WRITE LED_GREEN ON");
        BSP_LED_On(LED_GREEN);
      }
      else {
        APP_DBG("WRITE LED_GREEN OFF");
        BSP_LED_Off(LED_GREEN);
      }
      return ZCL_STATUS_SUCCESS;

    default:
        return ZCL_STATUS_UNSUPP_ATTRIBUTE;
  }
}

/**
 * @brief  ZCL Attribute read/write callback handler
 * @param  clusterPtr : ZCL Cluster pointer
 * @param  cb         : Attribute callback info
 * @retval ZCL Status code
 */
static enum ZclStatusCodeT
zcl_attr_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclAttrCbInfoT *cb)
{
  if (cb->type == ZCL_ATTR_CB_TYPE_WRITE) {
        return zcl_attr_write_cb(clusterPtr, cb->src, cb->info->attributeId, cb->zcl_data, cb->zcl_len,
            cb->attr_data, cb->write_mode, cb->app_cb_arg);
  }
  else {
      return ZCL_STATUS_FAILURE;
  }
}

/**
 * @brief  IAS WD StartWarning server command callback
 * @param  clusterPtr: cluster pointer
 * @param  arg: passed argument
 * @param  warn_req: StartWarning request
 * @retval ZCL status
 */
static enum ZclStatusCodeT APP_ZIGBEE_IAS_WD_Server_StartWarning_cb(struct ZbZclClusterT *clusterPtr, void *arg, struct ZbZclIasWdClientStartWarningReqT *warn_req){
  APP_DBG("[IAS WD] IAS WD StartWarning command received.");

  /* Dumping the request parameters */
  APP_DBG("[IAS WD] Warning mode: 0x%02x.",  warn_req->warning_mode);
  APP_DBG("[IAS WD] Warning duration: 0x%04x.",  warn_req->warning_duration);
  APP_DBG("[IAS WD] Siren level: 0x%02x.",  warn_req->siren_level);
  APP_DBG("[IAS WD] Strobe enabled?  %s.",  (warn_req->strobe) ? "Yes" : "No");
  APP_DBG("[IAS WD] Strobe duty cycle: 0x%02x.\n",  warn_req->strobe_dutycycle);

  /* activate the warning state */
  memcpy(&warningReq, warn_req, sizeof(warningReq));
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_APP_IAS_WD_START_WARNING, CFG_SCH_PRIO_0);

  return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  IAS WD Squawk server command callback
 * @param  clusterPtr: cluster pointer
 * @param  arg: passed argument
 * @param  warn_req: Squawk request
 * @retval ZCL status
 */
static enum ZclStatusCodeT APP_ZIGBEE_IAS_WD_Server_Squawk_cb(struct ZbZclClusterT *clusterPtr, void *arg, struct ZbZclIasWdClientSquawkReqT *squawk_req){
  APP_DBG("[IAS WD] IAS WD Squawk command received.");

  /* Dumping the request parameters */
  APP_DBG("[IAS WD] Squawk mode: 0x%02x.",  squawk_req->squawk_mode);
  APP_DBG("[IAS WD] Squawk level: 0x%02x.",  squawk_req->squawk_level);
  APP_DBG("[IAS WD] Strobe enabled?  %s.\n",  (squawk_req->strobe) ? "Yes" : "No");

  APP_DBG("[IAS WD] Activating Squawk signal.");
  is_Squawk_strobe = (bool)squawk_req->strobe;
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_APP_IAS_WD_SQUAWK, CFG_SCH_PRIO_0);

  return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  Zigbee application IAS WD StartWarning command processing
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_IAS_WD_Server_Alarm_Processing(void){
  enum ZclStatusCodeT status;
  enum ZclDataTypeT type;
  uint16_t warning_duration = warningReq.warning_duration;
  uint16_t max_duration = 0;

  /* reading local MaxDuration attribute */
  type = ZCL_DATATYPE_UNSIGNED_16BIT;
  max_duration = (uint16_t)ZbZclAttrIntegerRead(zigbee_app_info.ias_wd_server, ZCL_IAS_WD_SVR_ATTR_MAX_DURATION, &type, &status);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("[IAS WD] Error, ZbZclAttrIntegerRead failed");
    assert(0);
  }

  if (max_duration<warning_duration) {
     /* the alarm cannot last ;ore that MaxDuration attribute value */
    warning_duration = max_duration;
  }

  for (unsigned int cpt=0 ; cpt<warning_duration ; cpt++) {
    APP_DBG("[IAS WD] Alarm!");
    if (warningReq.strobe) {
      /* strobe enabled */
      BSP_LED_On(LED_RED);
      HAL_Delay(warningReq.strobe_dutycycle*10); /* time in ms corresponding to strobe duty cycle */
      BSP_LED_Off(LED_RED);
      HAL_Delay(1000 - warningReq.strobe_dutycycle*10); /* remaining time in 1s */
    } else {
      HAL_Delay(1000);
    }
  }

  APP_DBG("[IAS WD] Alarm ended.\n");
}

/**
 * @brief  Zigbee application IAS WD Squawk command processing
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_IAS_WD_Server_Squawk_Processing(void){
  for (unsigned int cpt=0 ; cpt<3 ; cpt++) { /* 3 sec loop */
    APP_DBG("[IAS WD] Squawk!");
    if (is_Squawk_strobe) {
      BSP_LED_On(LED_RED);
    }
    HAL_Delay(100);

    if (is_Squawk_strobe) {
      BSP_LED_Off(LED_RED);
    }
    HAL_Delay(100);
  }
  APP_DBG("[IAS WD] Squawk signal ended.\n");
}

/**
 * @brief  Messaging get last message server command callback
 * @param  clusterPtr: cluster pointer
 * @param  arg: passed argument
 * @param  conf: message confirmation
 * @param  srcInfo: sender address information
 * @retval ZCL status
 */
static enum ZclStatusCodeT APP_ZIGBEE_Msg_get_last_cb(struct ZbZclClusterT *cluster, void *arg, struct ZbZclAddrInfoT *srcInfo)
{
  APP_DBG("[MESSAGE] Get Last Message");
  APP_DBG(msg_buf);
  return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  Messaging get last message server command callback
 * @param  clusterPtr: cluster pointer
 * @param  arg: passed argument
 * @param  conf: message confirmation
 * @param  srcInfo: sender address information
 * @retval ZCL status
 */
static enum ZclStatusCodeT APP_ZIGBEE_Msg_confirm_cb(struct ZbZclClusterT *cluster, void *arg,
struct ZbZclMsgMessageConfT *conf, struct ZbZclAddrInfoT *srcInfo)
{
  APP_DBG("[MESSAGE] MSG CONFIRM");
  return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

